---
kind: other
id: Methods.T:Autodesk.Revit.DB.WallType
source: html/6a101820-0830-21b3-6a05-10a0444f4b1f.htm
---
# WallType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.